# Проверка телефона
#     8 (916) 000-22-33 — Да
#     +380 503330011 — Да
#     058 68 5858 7 — Да
#     384934993489348849393 — Нет
#     плюс семь, девять-девать-девять — Нет
import re

numbers = """8 (916) 000-22-33
+ 380 503330011
058 68 5858 7
384934993489348849393
плюс семь, девять-девать-девять
"""
patrn = re.compile(
    r'^(?:\+?\s?\d{1,3}\s)(?:\(\d{3}\)\s)? \
                    (?:(?:\d{3}\-\d{2}\-\d{2})|(?:\d{9})|(?:\d{2}\s\d{4}\s\d{1}))',
    re.MULTILINE,
)
result = re.findall(patrn, numbers)
print(result)
